Revit 2027 API
Solid.GetBoundingBox Method
 Retrieves a box that circumscribes the solid geometry.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public BoundingBoxXYZ GetBoundingBox()
Public Function GetBoundingBox As BoundingBoxXYZ
public:
BoundingBoxXYZ^ GetBoundingBox()
member GetBoundingBox : unit -> BoundingBoxXYZ
Return Value
BoundingBoxXYZ
Remarks
 The bounding box information is stored as bounds in local coordinates and a transform. So the transform is to be taken in to account when using the bounds. This is different from the bounding box returned by Element.BoundingBox in that the bounding box returned by that routine stores the bounds in modeling coordinates with an identity transform.
See Also
Reference
Solid Class
Autodesk.Revit.DB Namespace